Revit 2017 API
AssetSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public virtual AssetSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As AssetSetIterator
Visual C++
public:
virtual AssetSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
AssetSet Class
Autodesk.Revit.Utility Namespace